espressif/esp-idf/components/soc/esp32c6/register/soc/ledc_reg.h
/** LEDC_CH0_GAMMA_WR_REG register
 *  Ledc ch0 gamma ram write register.
 */
#define LEDC_CH0_GAMMA_WR_REG (DR_REG_LEDC_BASE + 0x100)
/** LEDC_CH0_GAMMA_DUTY_INC : R/W; bitpos: [0]; default: 0;
 *  Ledc ch0 gamma duty inc of current ram write address.This register is used to
 *  increase or decrease the duty of output signal on channel 0.
 *
 *  1: Increase  0: Decrease.
 */
#define LEDC_CH0_GAMMA_DUTY_INC    (BIT(0))
#define LEDC_CH0_GAMMA_DUTY_INC_M  (LEDC_CH0_GAMMA_DUTY_INC_V << LEDC_CH0_GAMMA_DUTY_INC_S)
#define LEDC_CH0_GAMMA_DUTY_INC_V  0x00000001U
#define LEDC_CH0_GAMMA_DUTY_INC_S  0
/** LEDC_CH0_GAMMA_DUTY_CYCLE : R/W; bitpos: [10:1]; default: 0;
 *  Ledc ch0 gamma duty cycle of current ram write address.The duty will change every
 *  LEDC_CH0_GAMMA_DUTY_CYCLE on channel 0.
 */
#define LEDC_CH0_GAMMA_DUTY_CYCLE    0x000003FFU
#define LEDC_CH0_GAMMA_DUTY_CYCLE_M  (LEDC_CH0_GAMMA_DUTY_CYCLE_V << LEDC_CH0_GAMMA_DUTY_CYCLE_S)
#define LEDC_CH0_GAMMA_DUTY_CYCLE_V  0x000003FFU
#define LEDC_CH0_GAMMA_DUTY_CYCLE_S  1
/** LEDC_CH0_GAMMA_SCALE : R/W; bitpos: [20:11]; default: 0;
 *  Ledc ch0 gamma scale of current ram write address.This register is used to
 *  configure the changing step scale of duty on channel 0.
 */
#define LEDC_CH0_GAMMA_SCALE    0x000003FFU
#define LEDC_CH0_GAMMA_SCALE_M  (LEDC_CH0_GAMMA_SCALE_V << LEDC_CH0_GAMMA_SCALE_S)
#define LEDC_CH0_GAMMA_SCALE_V  0x000003FFU
#define LEDC_CH0_GAMMA_SCALE_S  11
/** LEDC_CH0_GAMMA_DUTY_NUM : R/W; bitpos: [30:21]; default: 0;
 *  Ledc ch0 gamma duty num of current ram write address.This register is used to
 *  control the number of times the duty cycle will be changed.
 */
#define LEDC_CH0_GAMMA_DUTY_NUM    0x000003FFU
#define LEDC_CH0_GAMMA_DUTY_NUM_M  (LEDC_CH0_GAMMA_DUTY_NUM_V << LEDC_CH0_GAMMA_DUTY_NUM_S)
#define LEDC_CH0_GAMMA_DUTY_NUM_V  0x000003FFU
#define LEDC_CH0_GAMMA_DUTY_NUM_S  21

/** LEDC_CH0_GAMMA_WR_ADDR_REG register
 *  Ledc ch0 gamma ram write address register.
 */
#define LEDC_CH0_GAMMA_WR_ADDR_REG (DR_REG_LEDC_BASE + 0x104)
/** LEDC_CH0_GAMMA_WR_ADDR : R/W; bitpos: [3:0]; default: 0;
 *  Ledc ch0 gamma ram write address.
 */
#define LEDC_CH0_GAMMA_WR_ADDR    0x0000000FU
#define LEDC_CH0_GAMMA_WR_ADDR_M  (LEDC_CH0_GAMMA_WR_ADDR_V << LEDC_CH0_GAMMA_WR_ADDR_S)
#define LEDC_CH0_GAMMA_WR_ADDR_V  0x0000000FU
#define LEDC_CH0_GAMMA_WR_ADDR_S  0

/** LEDC_CH0_GAMMA_RD_ADDR_REG register
 *  Ledc ch0 gamma ram read address register.
 */
#define LEDC_CH0_GAMMA_RD_ADDR_REG (DR_REG_LEDC_BASE + 0x108)
/** LEDC_CH0_GAMMA_RD_ADDR : R/W; bitpos: [3:0]; default: 0;
 *  Ledc ch0 gamma ram read address.
 */
#define LEDC_CH0_GAMMA_RD_ADDR    0x0000000FU
#define LEDC_CH0_GAMMA_RD_ADDR_M  (LEDC_CH0_GAMMA_RD_ADDR_V << LEDC_CH0_GAMMA_RD_ADDR_S)
#define LEDC_CH0_GAMMA_RD_ADDR_V  0x0000000FU
#define LEDC_CH0_GAMMA_RD_ADDR_S  0

/** LEDC_CH0_GAMMA_RD_DATA_REG register
 *  Ledc ch0 gamma ram read data register.
 */
#define LEDC_CH0_GAMMA_RD_DATA_REG (DR_REG_LEDC_BASE + 0x10c)
/** LEDC_CH0_GAMMA_RD_DATA : RO; bitpos: [30:0]; default: 0;
 *  Ledc ch0 gamma ram read data.
 */
#define LEDC_CH0_GAMMA_RD_DATA    0x7FFFFFFFU
#define LEDC_CH0_GAMMA_RD_DATA_M  (LEDC_CH0_GAMMA_RD_DATA_V << LEDC_CH0_GAMMA_RD_DATA_S)
#define LEDC_CH0_GAMMA_RD_DATA_V  0x7FFFFFFFU
#define LEDC_CH0_GAMMA_RD_DATA_S  0

/** LEDC_CH1_GAMMA_WR_REG register
 *  Ledc ch1 gamma ram write register.
 */
#define LEDC_CH1_GAMMA_WR_REG (DR_REG_LEDC_BASE + 0x110)
/** LEDC_CH1_GAMMA_DUTY_INC : R/W; bitpos: [0]; default: 0;
 *  Ledc ch1 gamma duty inc of current ram write address.This register is used to
 *  increase or decrease the duty of output signal on channel 1.
 *
 *  1: Increase  0: Decrease.
 */
#define LEDC_CH1_GAMMA_DUTY_INC    (BIT(0))
#define LEDC_CH1_GAMMA_DUTY_INC_M  (LEDC_CH1_GAMMA_DUTY_INC_V << LEDC_CH1_GAMMA_DUTY_INC_S)
#define LEDC_CH1_GAMMA_DUTY_INC_V  0x00000001U
#define LEDC_CH1_GAMMA_DUTY_INC_S  0
/** LEDC_CH1_GAMMA_DUTY_CYCLE : R/W; bitpos: [10:1]; default: 0;
 *  Ledc ch1 gamma duty cycle of current ram write address.The duty will change every
 *  LEDC_CH1_GAMMA_DUTY_CYCLE on channel 1.
 */
#define LEDC_CH1_GAMMA_DUTY_CYCLE    0x000003FFU
#define LEDC_CH1_GAMMA_DUTY_CYCLE_M  (LEDC_CH1_GAMMA_DUTY_CYCLE_V << LEDC_CH1_GAMMA_DUTY_CYCLE_S)
#define LEDC_CH1_GAMMA_DUTY_CYCLE_V  0x000003FFU
#define LEDC_CH1_GAMMA_DUTY_CYCLE_S  1
/** LEDC_CH1_GAMMA_SCALE : R/W; bitpos: [20:11]; default: 0;
 *  Ledc ch1 gamma scale of current ram write address.This register is used to
 *  configure the changing step scale of duty on channel 1.
 */
#define LEDC_CH1_GAMMA_SCALE    0x000003FFU
#define LEDC_CH1_GAMMA_SCALE_M  (LEDC_CH1_GAMMA_SCALE_V << LEDC_CH1_GAMMA_SCALE_S)
#define LEDC_CH1_GAMMA_SCALE_V  0x000003FFU
#define LEDC_CH1_GAMMA_SCALE_S  11
/** LEDC_CH1_GAMMA_DUTY_NUM : R/W; bitpos: [30:21]; default: 0;
 *  Ledc ch1 gamma duty num of current ram write address.This register is used to
 *  control the number of times the duty cycle will be changed.
 */
#define LEDC_CH1_GAMMA_DUTY_NUM    0x000003FFU
#define LEDC_CH1_GAMMA_DUTY_NUM_M  (LEDC_CH1_GAMMA_DUTY_NUM_V << LEDC_CH1_GAMMA_DUTY_NUM_S)
#define LEDC_CH1_GAMMA_DUTY_NUM_V  0x000003FFU
#define LEDC_CH1_GAMMA_DUTY_NUM_S  21

/** LEDC_CH1_GAMMA_WR_ADDR_REG register
 *  Ledc ch1 gamma ram write address register.
 */
#define LEDC_CH1_GAMMA_WR_ADDR_REG (DR_REG_LEDC_BASE + 0x114)
/** LEDC_CH1_GAMMA_WR_ADDR : R/W; bitpos: [3:0]; default: 0;
 *  Ledc ch1 gamma ram write address.
 */
#define LEDC_CH1_GAMMA_WR_ADDR    0x0000000FU
#define LEDC_CH1_GAMMA_WR_ADDR_M  (LEDC_CH1_GAMMA_WR_ADDR_V << LEDC_CH1_GAMMA_WR_ADDR_S)
#define LEDC_CH1_GAMMA_WR_ADDR_V  0x0000000FU
#define LEDC_CH1_GAMMA_WR_ADDR_S  0

/** LEDC_CH1_GAMMA_RD_ADDR_REG register
 *  Ledc ch1 gamma ram read address register.
 */
#define LEDC_CH1_GAMMA_RD_ADDR_REG (DR_REG_LEDC_BASE + 0x118)
/** LEDC_CH1_GAMMA_RD_ADDR : R/W; bitpos: [3:0]; default: 0;
 *  Ledc ch1 gamma ram read address.
 */
#define LEDC_CH1_GAMMA_RD_ADDR    0x0000000FU
#define LEDC_CH1_GAMMA_RD_ADDR_M  (LEDC_CH1_GAMMA_RD_ADDR_V << LEDC_CH1_GAMMA_RD_ADDR_S)
#define LEDC_CH1_GAMMA_RD_ADDR_V  0x0000000FU
#define LEDC_CH1_GAMMA_RD_ADDR_S  0

